class NameInputTesting:
    positive_name = ['Ая', 'Ив', 'Аня', 'Ваня', 'Иван', 'Ванюша', 'Ванька', 'Анна-Мария', 'Иван-Марья', 'Саша-Саша',
                     'игнат', 'оля', 'КОля', 'витАЛий', 'аСя', 'ВАСЯ ', 'Маша             ', '      Семен', ' Семён ',
                     'Семен              ', 'Абвгдежзийклмнопрстуфхцчшщыэюя']

    negative_name = ['-', '--', '- - -', 'у', 'А-', '-Аня', '-Анна-', 'Анна Мария', 'Аня-Ваня-Вася', 'Аня_Ваня',
                     'Иван громкий барабан', 'Абвгдеёжзийклмнопрстуфхцчшщыэюя', 'Ва1нюш2а', 'Ваnьkа', 'Са!ша',
                     'Алекс@ндр', 'Алек/сандра', 'Сан+ка', 'Jon', 'ваlenтин', '123456', '!@#$$%^&*()',
                     'fh546dg*:?;№hKRY', '<script>alert("Поле input уязвимо!")</script>',
                     '14jYuZsGlJjYxOYdPTJebhuJgGgWuaYBpUbxEtxKEhGtXiuBkyCIufWQqTAbaXlAQzaZOEvvxRgGaMKTFLduRaouihOuXjx'
                     'PXqbjzkjPSCYbtFaqiDBnzNcJymvCsPTAEWlFBofUqdhmSpOihjBumquPfqWXkmEUSvsXGQAVBwZZsSXsXQYnYPrCbCZRoJ'
                     'IBOgSRJpePQWGBlPCnrIlkOdYobRLcXFgbwxRmwySAvfHLiBVyhIudSNenbvyjzZxraJzMKupefOTeKoNiIiAfiEKIvoABM'
                     'dFYcUWsibgfmcsDnExHGpozUFTetzoCTSdTGckvgJicwngwV7EKIoBeGuYLCouOGOSZWMSPpPFCVSagjiXZIxvZVWkdomVw'
                     'MjxvOxpCotcTxAsVdQSTEujFqccMxVtWQayFdFDrDOrWMsRLymSNYgVyCLuIPMlcxhzFVFhMgpRwhHYfjQVWsaOpkhEnkfl'
                     'RtqkZQgFeOeLm21']


class MailPhoneInputTesting:
    positive_data = ['89998887766', '79998887766', '9998887766', '375999888777',
                     'ga@GA.Ga', 'GA@GA.GA', 'dg@bkkj.jhgg.hjhg']

    negative_data = ['Fhg', 'dg@bkkj.jhgg.hjhg.', 'bkj.jhg.hjhg', 'bk@j@jhg.hjhg', 'шриг@ригрР.ОМр',
                     '123456789', '12345678900', '7999888776', '799988877665', '37599988877', '3759998887776']


class PasswordInputTesting:
    positive_pass = ['Fhgglhgjh64656', 'sgdfs$dgJHIJHJIHjh', 'Ff!@#$%^&*():;"<>~']

    negative_pass = ['Fhgqwer', 'sgdfsdghxvhg', 'шригригрРОМр', '16519841651651', 'F!@#$%^&*():;"<>~',
                     'f!@#$%^&*():;"<>~', 'dHkjhАПолпkjhkj', 'sghgGHGHggjjhghg32767%*^^%65865']


class RegionTesting:
    list_subjects = ['Республика Казахстан', 'Республика Беларусь', 'Алтай Респ', 'Алтайский край', 'Амурская обл',
                     'Архангельская обл', 'Астраханская обл', 'Байконур г', 'Башкортостан Респ', 'Белгородская обл',
                     'Брянская обл',
                     'Владимирская обл', 'Волгоградская обл', 'Вологодская обл', 'Воронежская обл', 'Еврейская Аобл',
                     'Забайкальский край',
                     'Ивановская обл', 'Иркутская обл', 'Кабардино-Балкарская Респ', 'Калининградская обл',
                     'Калмыкия Респ', 'Калужская обл',
                     'Камчатский край', 'Карелия Респ', 'Кемеровская обл', 'Кировская обл', 'Коми Респ',
                     'Костромская обл',
                     'Краснодарский край', 'Красноярский край', 'Крым Респ', 'Курганская обл', 'Курская обл',
                     'Ленинградская обл',
                     'Липецкая обл', 'Магаданская обл', 'Марий Эл Респ', 'Мордовия Респ', 'Москва г', 'Московская обл',
                     'Мурманская обл',
                     'Ненецкий АО', 'Нижегородская обл', 'Новгородская обл', 'Новосибирская обл', 'Омская обл',
                     'Оренбургская обл',
                     'Орловская обл', 'Пензенская обл', 'Пермский край', 'Приморский край', 'Псковская обл',
                     'Адыгея Респ', 'Бурятия Респ',
                     'Дагестан Респ', 'Ингушетия Респ', 'Карачаево-Черкесская Респ', 'Севастополь г', 'Ростовская обл',
                     'Рязанская обл',
                     'Самарская обл', 'Санкт-Петербург г', 'Саратовская обл', 'Сахалинская обл', 'Саха /Якутия/ Респ',
                     'Свердловская обл',
                     'Северная Осетия - Алания Респ', 'Смоленская обл', 'Ставропольский край', 'Тамбовская обл',
                     'Татарстан Респ',
                     'Тверская обл', 'Томская обл', 'Тульская обл', 'Тыва Респ', 'Тюменская обл', 'Удмуртская Респ',
                     'Ульяновская обл',
                     'Хабаровский край', 'Хакасия Респ', 'Ханты-Мансийский Автономный округ - Югра АО',
                     'Челябинская обл', 'Чеченская Респ',
                     'Чувашская Республика', 'Чукотский АО', 'Ямало-Ненецкий АО', 'Ярославская обл']
